app/views/lists/index.html.erb

SELECT "lists".* FROM "lists"
---
					<ul class="todo_list">
						<% user.lists.each do |list| %>