app/views/lists/show.html.erb

SELECT  "items".* FROM "items" WHERE "items"."list_id" = ? AND "items"."id" = ? LIMIT 1  [["list_id", 3], ["id", 10]]
---
    <ul class="todo-list">
      <% @list.items.each do |item| %>