app/controllers/items_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "items" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Golf"], ["list_id", 2], ["created_at", "2016-11-13 20:56:49.602729"], ["updated_at", "2016-11-13 20:56:49.602729"]]
---
  def create
    @list = List.find(params[:list_id])
    @item = @list.items.build(item_params)
      if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", 1], ["updated_at", "2016-11-15 11:43:49.874557"], ["id", 7]]
---
  def update
    @item = Item.find(params[:id])
    @item.update(item_params)