app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
      redirect_to list_path(@list)
    else
      @lists = List.all
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Fruit"], ["created_at", "2016-11-13 18:34:01.611469"], ["updated_at", "2016-11-13 18:34:01.611469"]]
SELECT "lists".* FROM "lists"